<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

jedah RIP

POV: Scelesta

Log Rating: 0.2857

Jedah xfers his eq, knowing he is going to die.

283H 217V 11368638X 612C Mem:1 Exits:ESW> c 'h p' jedah
Eliza rests in the shade of the apple tree.
283H 217V 11368638X 612C Mem:1 Exits:ESW> Who should the spell be cast
upon?
283H 217V 11368638X 612C Mem:1 Exits:ESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Jedah Phu, Black Dragon Clan is standing here. (flying)
Looking south:
You see nothing special.
A traveling mercenary is here, seeking employment.
Looking west:
You see nothing special.
Looking up:
The branches of an apple tree hang overhead.
Looking down:
You see nothing special.
283H 217V 11368638X 612C Mem:1 Exits:ESW>
Jedah flies in from the east.
283H 217V 11368638X 612C [**Jedah:V.Good**] Mem:1 Exits:ESW> st
c 'h p' jedah
Eliza steps aside as Jedah attempts a bash, stumbles, and falls flat on
his face.
283H 217V 11368638X 612C [**Jedah:V.Good**] [**Eliza:Perfect**] Mem:1
Exits:ESW> You stand up.
283H 217V 11368638X 612C [**Jedah:V.Good**] [**Eliza:Perfect**] Mem:1
Exits:ESW>
Eliza issues the order 'bash jedah'.
Jedah steps aside as a guard attempts a bash, stumbles, and falls flat
on his face.
283H 217V 11368638X 612C [**Jedah:V.Good**] [**Eliza:Perfect**] Mem:1
Exits:ESW> You utter the wo
rds, 'hold person'
283H 217V 11368638X 612C [**Jedah:V.Good**] [**Eliza:Perfect**] Mem:2
Exits:ESW> c 'h p' jedah
A guard hits Jedah very hard.
Jedah slashes Eliza extremely hard.
Eliza misses Jedah with her hit.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:V.Good**] Mem:2
Exits:ESW>
Through your wizard's eye: Tapesh has left through the north exit.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:V.Good**] Mem:2
Exits:ESW> You utter the words
, 'hold person'
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:V.Good**] Mem:2
Exits:ESW> c 'h p' jedah
Eliza issues the order 'st'.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:V.Good**] Mem:2
Exits:ESW>
Eliza issues the order 'vbas'.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:V.Good**] Mem:2
Exits:ESW>
A guard hits Jedah very hard.
Jedah slashes Eliza extremely hard.
Eliza misses Jedah with her hit.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:2
Exits:ESW>
Through your wizard's eye: Tarwey has left through the north exit.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:2
Exits:ESW>
Jedah stands up.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:2
Exits:ESW>
Eliza issues the order 'st'.
A guard stands up.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:2
Exits:ESW>
Jedah crashes into Eliza in a thundering collision, knocking her to the
ground!
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:2
Exits:ESW> You utter the words,
'hold person'
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Good**] Mem:3
Exits:ESW>
A guard hits Jedah hard.
A guard misses Jedah with his hit.
Jedah massacres Eliza with his slash.
Eliza misses Jedah with her hit.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW> c 'h p' jeadh
Who should the spell be cast upon?
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW> c 'h p' jedah
You utter the words, 'hold person'
Jedah freezes in place.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW> o all.ogre bac jedah
A guard hits Jedah hard.
Eliza barely hits Jedah.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW>
Eliza issues the order 'bas'.
A guard crashes into Jedah in a thundering collision, knocking him to
the ground!
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW>
Eliza stands up.
283H 217V 11368638X 612C [**Jedah:Good**] [**Eliza:Fair**] Mem:3
Exits:ESW> An ogre scout slowly
fades into existence.
An ogre scout gives his spear a quick thrust and twist, as he strikes
Jedah in the back with it.
An ogre scout slowly fades into existence.
An ogre scout places an ogre spear in Jedah's back, resulting in some
strange noises and some blo
od.
An ogre scout slowly fades into existence.
An ogre scout places a copper shortsword in Jedah's back, resulting in
some strange noises and so
me blood.
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] [**Eliza:Fair**] Mem:3
Exits:ESW>
Eliza utters the words, 'qarw'.
Jedah stops fighting Eliza.
An ogre scout stops fighting Jedah.
An ogre scout stops fighting Jedah.
An ogre scout stops fighting Jedah.
A guard stops fighting Jedah.
Eliza stops fighting Jedah.
An ogre scout looks annoyed with Eliza.
An ogre scout misses Eliza with his pierce.
An ogre scout looks calmer.
An ogre scout looks calmer.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
Eliza misses an ogre scout with her hit.
An ogre scout misses Eliza with his pierce.
An ogre scout misses Eliza with his slash.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> You issue
the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
o all.ogre bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
o all.ogre bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
o all.ogre bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
o all.ogre bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Fair**] Mem:3 Exits:ESW> o all.ogre
bac jedah
An ogre scout places an ogre spear in Jedah's back, resulting in some
strange noises and some blo
od.
An ogre scout gives his sword a quick thrust and twist, as he strikes
Jedah in the back with it.
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Bad**] [**an ogre scout:Perfect**]
Mem:3 Exits:ESW> o all.ogre
bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:Bad**] [**an ogre scout:Perfect**]
Mem:3 Exits:ESW> You issue t
he order 'bac jedah'.
Eliza panics, and attempts to flee.
Eliza flies south.
283H 217V 11368638X 612C [**Jedah:Bad**] [**an ogre scout:Perfect**]
Mem:3 Exits:ESW> o all.ogre
bac jedah
An ogre scout gives his spear a quick thrust and twist, as he strikes
Jedah in the back with it.
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:3 Exits:ESW> o all.ogr
e bac jedah
An ogre scout pierces Jedah extremely hard.
An ogre scout slashes Jedah very hard.
An ogre scout pierces Jedah extremely hard.
An ogre scout pierces Jedah very hard.
An ogre scout slashes Jedah very hard.
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:2 Exits:ESW> You issue
the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:2 Exits:ESW> You issue
the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:2 Exits:ESW>
Eliza flies in from the south.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:2 Exits:ESW>
o all.ogr
e bac jedah
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [**Jedah:V.Bad**] [**an ogre scout:Perfect**]
Mem:2 Exits:ESW>
Eliza utters the words, 'qarw'.
Jedah stops fighting an ogre scout.
An ogre scout stops fighting Jedah.
An ogre scout stops fighting Jedah.
An ogre scout stops fighting Jedah.
An ogre scout looks calmer.
An ogre scout looks calmer.
An ogre scout looks calmer.
A guard looks calmer.
283H 217V 11368638X 612C [**Jedah:V.Bad**] Mem:2 Exits:ESW> c 'f b'
jedah
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Jedah.
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW> o all.ogre bac jedah
You stop watching Jedah.
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW>
You bludgeon Jedah very hard.
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW>
Kendrick shouts 'seeking level 25+cleric neutral/evil!'
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW>
Eliza issues the order 'bash jedah'.
A guard crashes into Jedah in a thundering collision, knocking him to
the ground!
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW>
Eliza issues the order 'st'.
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW>
Eliza issues the order 'bas'.
283H 217V 11368638X 612C [Scelesta:Perfect] [Jedah:Awful] Mem:3
Exits:ESW> An ogre scout places a
n ogre spear in the back of Jedah, resulting in some strange noises, a
lot of blood and a corpse.
You receive 0 experience.
get coins corpse
Jedah is dead! R.I.P.
You issue the order 'bac jedah'.
283H 217V 11368638X 612C [Jedah:Dying] Mem:3 Exits:ESW>
The death cry of Jedah echoes from somewhere nearby...
283H 217V 11368638X 612C Mem:3 Exits:ESW> You get a pile of coins from
the corpse of Jedah.
sp 83
There were 83 coins.
283H 217V 11368638X 695C Mem:3 Exits:ESW> get all jedah
You can't split 83 evenly among the people in the room; splitting 82
instead.
You divide 82 coins equally among the group members present.
283H 217V 11368638X 654C Mem:3 Exits:ESW> You get a swordfish's sword
from the corpse of Jedah.
You get a large golden shield from the corpse of Jedah.
You get a waterskin from the corpse of Jedah.
You get a waterskin from the corpse of Jedah.
You get a waterskin from the corpse of Jedah.
You get a sextant from the corpse of Jedah.
283H 217V 11368638X 654C Mem:3 Exits:ESW>

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
